# IsStructuralDeck Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
CompoundStructure..::..IsStructuralDeck Method
CompoundStructure Class See Also
---
Determines whether a specified layer is a structural deck.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public bool IsStructuralDeck(
	int layerIdx
)
```

Visual Basic
---
```text
Public Function IsStructuralDeck ( _
	layerIdx As Integer _
) As Boolean
```

Visual C++
---
```text
public:
bool IsStructuralDeck(
	int layerIdx
)
```

# ### Parameters
layerIdx
    Type: System..::..Int32 Index of a layer in the CompoundStructure.
# ### Return Value
True if specified layer is a structural deck, and false otherwise.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | The layer index is out of range. |

# See Also
CompoundStructure Class
Autodesk.Revit.DB Namespace